# 드디어 모의외주 시작

# - 목표
# 1. 7주간 학습한 것에 대한 종합 복습
# 2. 프로젝트 기회에 대한 기초 문서 작업(요구사항 명세서는 준다.)나는 스토리 보드부터
# 3. 고객 입장을 고려한 개발 연습 (예외 처리 등)


# - 모의외주 전 기억해야 할 사항
# 1. 7주간 했던 피드백 다시한번 읽어보기( 꼭 읽어보기 ! ! ! )
# 2. 인정받는 개발자의 3원칙 다시한번 상기시킬 것


# - 일정계획
# 8주차 : 고객과의 첫 미팅
#     -가상미팅 + 문서작업 + 프론트엔드 부분 개발(수요일 오후 3시까지 스토리보드 먼저 만들고 컨펌 -> ui, 클래스 다이어그램, 페이지 넘기기 등 간단한 로직 짜기)
#     스토리 보드 작성시 : 발생할 수 있는 모든 화면 작성해 주어야 함. 다이얼로그 까지  디자인과 흐름 ppt로 요구명세서 참고해서 하기! 디자인 신경쓸 시간이 없을걸?


# ----모르는거 클래스 다이어그램이라던 있으면 한번 컨펌 받아!!!! 여유두고 해!!!!! 고객과 연락 많이 할 것 

# 9주차 : 중간미팅
#     -개발 진척도 보고 + 기존 설계와 달라진 점에 대한 보고(타당한 근거)
#     -수업 : 깃허브 강의

# 10주차 : 최종 보고
#     -정식적으로 완성된 프로그램 보고



# 미팅 전략과 개발자의 스피치

# - 첫 미팅의 목표
# 1. 고객이 머리로 생각하고 있느 프로그램과, 내 머릿속 상상이 1:1 매칭이 될 때까지 질문!
#     - 제대로 설계하지 않은 내용은 어차피 수정사항으로 돌아옴
#     - 첫 미팅에 모든 내용이 정해지지 않으면 귀찮다. 중간에 전화하는게 더 귀찬아 시간 잡아먹고

# 2. 개발자가 얘기를 들으면서 능동적으로 프로그램을 설계하는 자리(왜 능동적으로?)
#     -대부분의 고객은 절대로 세부적인 것 까지 생각해오지 않습니다. ex)저 페이스북 만들건데 얼마에요?
#     -언어 확정, 플랫폼 선택(고객은 홈페이지와 앱의 차이도 모른다), 페이지 명세 & 기능 명세까지(페이지 설계라던가) 모두 전문가(개발자)의 몫이다.
#     -우리가 이 프로그램의 실제 사용자라고 상상을 하면서, 필요한 기능과 조건을 설계합니다. 개발자는 코딩하는 사람이 아니라 문제를 해결하는 사람이다.




# - 미팅에서의 주의사항
# 1. 미팅 후 작성할 문서에는 단 하개의 내용이라도 빠지면 안됨
#     -분쟁이 발생했을 때, 우리를 지켜줄 내용이 이 문서
#     -미팅 때 녹음을 하던, 메모를 잘하던 << 꼼꼼해야 한다.
# 2. 먼저 질문할 것
# - 이 부분은 당연히 이거겠지 어림잡아 생각하지 말것 절대! 우리에게 당연한 것이 고객에겐 당연하지 않을 확률 높다. 서버가 없다고 어림짐작 X 모든 부분을 물고보고 확정을 받아야 한다.
# - 당연히 데이터베이스 필요할 것이라고 생각했는데, 알고보니 db가 아니라 메모장을 기준으로 주고받는 파일입출력을 사용해달라고 했었다.

# 3. 절대 나만 아는 전문용어 쓰지 말 것 처음부터 모르는 것 을 고려해서 얘기하자.





# - 미팅의 예상 흐름
# 1.프로그램의 목적 + 사용자
# 2.플랫폼은 어떤한가?(창 크기, 사용할 언어 및 라이브러리, DB등)
# 3. 페이지 구조, 페이지별 기능 확정짓기(유행이나 효율적인 방법을 모르니까 다 우리가 딱딱딱 정해주자)
#     -고객님 이 프로그램 구현 하시려면 로그인 기능 필요하시거든요, 저희가 넣어드릴게요. 능동적으로 설계하고, 첫 번째 페이지붙터 상상을 해 나아가면 됨(실제 사용이라 가정하고)
# 4. 대략적인 디자인
#     - 평소 즐겨 쓰거나 이뻤던 홈페이지나 프로그램이 있으신가요? 
#     - 프로그램에 메인 컬러는 어떻게 해드릴까요?



# 미팅 pass

# 고객의 요구명세서


